zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_SAI.h
#define SAI_TCR2_DIV_MASK                        (0xFFU)
#define SAI_TCR2_DIV_SHIFT                       (0U)
#define SAI_TCR2_DIV_WIDTH                       (8U)
#define SAI_TCR2_DIV(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_DIV_SHIFT)) & SAI_TCR2_DIV_MASK)

#define SAI_TCR2_BYP_MASK                        (0x800000U)
#define SAI_TCR2_BYP_SHIFT                       (23U)
#define SAI_TCR2_BYP_WIDTH                       (1U)
#define SAI_TCR2_BYP(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_BYP_SHIFT)) & SAI_TCR2_BYP_MASK)

#define SAI_TCR2_BCD_MASK                        (0x1000000U)
#define SAI_TCR2_BCD_SHIFT                       (24U)
#define SAI_TCR2_BCD_WIDTH                       (1U)
#define SAI_TCR2_BCD(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_BCD_SHIFT)) & SAI_TCR2_BCD_MASK)

#define SAI_TCR2_BCP_MASK                        (0x2000000U)
#define SAI_TCR2_BCP_SHIFT                       (25U)
#define SAI_TCR2_BCP_WIDTH                       (1U)
#define SAI_TCR2_BCP(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_BCP_SHIFT)) & SAI_TCR2_BCP_MASK)

#define SAI_TCR2_MSEL_MASK                       (0xC000000U)
#define SAI_TCR2_MSEL_SHIFT                      (26U)
#define SAI_TCR2_MSEL_WIDTH                      (2U)
#define SAI_TCR2_MSEL(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_MSEL_SHIFT)) & SAI_TCR2_MSEL_MASK)

#define SAI_TCR2_BCI_MASK                        (0x10000000U)
#define SAI_TCR2_BCI_SHIFT                       (28U)
#define SAI_TCR2_BCI_WIDTH                       (1U)
#define SAI_TCR2_BCI(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_BCI_SHIFT)) & SAI_TCR2_BCI_MASK)

#define SAI_TCR2_SYNC_MASK                       (0x40000000U)
#define SAI_TCR2_SYNC_SHIFT                      (30U)
#define SAI_TCR2_SYNC_WIDTH                      (1U)
#define SAI_TCR2_SYNC(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_SYNC_SHIFT)) & SAI_TCR2_SYNC_MASK)
/*! @} */

/*! @name TCR3 - Transmit Configuration 3 */
/*! @{ */

#define SAI_TCR3_WDFL_MASK                       (0xFU)
#define SAI_TCR3_WDFL_SHIFT                      (0U)
#define SAI_TCR3_WDFL_WIDTH                      (4U)
#define SAI_TCR3_WDFL(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCR3_WDFL_SHIFT)) & SAI_TCR3_WDFL_MASK)

#define SAI_TCR3_TCE_MASK                        (0xF0000U)  /* Merged from fields with different position or width, of widths (1, 4), largest definition used */
#define SAI_TCR3_TCE_SHIFT                       (16U)
#define SAI_TCR3_TCE_WIDTH                       (4U)
#define SAI_TCR3_TCE(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR3_TCE_SHIFT)) & SAI_TCR3_TCE_MASK)  /* Merged from fields with different position or width, of widths (1, 4), largest definition used */

#define SAI_TCR3_CFR_MASK                        (0xF000000U)
#define SAI_TCR3_CFR_SHIFT                       (24U)
#define SAI_TCR3_CFR_WIDTH                       (4U)
#define SAI_TCR3_CFR(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR3_CFR_SHIFT)) & SAI_TCR3_CFR_MASK)
/*! @} */

/*! @name TCR4 - Transmit Configuration 4 */
/*! @{ */

#define SAI_TCR4_FSD_MASK                        (0x1U)
#define SAI_TCR4_FSD_SHIFT                       (0U)
#define SAI_TCR4_FSD_WIDTH                       (1U)
#define SAI_TCR4_FSD(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FSD_SHIFT)) & SAI_TCR4_FSD_MASK)

#define SAI_TCR4_FSP_MASK                        (0x2U)
#define SAI_TCR4_FSP_SHIFT                       (1U)
#define SAI_TCR4_FSP_WIDTH                       (1U)
#define SAI_TCR4_FSP(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FSP_SHIFT)) & SAI_TCR4_FSP_MASK)

#define SAI_TCR4_ONDEM_MASK                      (0x4U)
#define SAI_TCR4_ONDEM_SHIFT                     (2U)
#define SAI_TCR4_ONDEM_WIDTH                     (1U)
#define SAI_TCR4_ONDEM(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_ONDEM_SHIFT)) & SAI_TCR4_ONDEM_MASK)

#define SAI_TCR4_FSE_MASK                        (0x8U)
#define SAI_TCR4_FSE_SHIFT                       (3U)
#define SAI_TCR4_FSE_WIDTH                       (1U)
#define SAI_TCR4_FSE(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FSE_SHIFT)) & SAI_TCR4_FSE_MASK)

#define SAI_TCR4_MF_MASK                         (0x10U)
#define SAI_TCR4_MF_SHIFT                        (4U)
#define SAI_TCR4_MF_WIDTH                        (1U)
#define SAI_TCR4_MF(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_MF_SHIFT)) & SAI_TCR4_MF_MASK)

#define SAI_TCR4_CHMOD_MASK                      (0x20U)
#define SAI_TCR4_CHMOD_SHIFT                     (5U)
#define SAI_TCR4_CHMOD_WIDTH                     (1U)
#define SAI_TCR4_CHMOD(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_CHMOD_SHIFT)) & SAI_TCR4_CHMOD_MASK)

#define SAI_TCR4_SYWD_MASK                       (0x1F00U)
#define SAI_TCR4_SYWD_SHIFT                      (8U)
#define SAI_TCR4_SYWD_WIDTH                      (5U)
#define SAI_TCR4_SYWD(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_SYWD_SHIFT)) & SAI_TCR4_SYWD_MASK)

#define SAI_TCR4_FRSZ_MASK                       (0xF0000U)
#define SAI_TCR4_FRSZ_SHIFT                      (16U)
#define SAI_TCR4_FRSZ_WIDTH                      (4U)
#define SAI_TCR4_FRSZ(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FRSZ_SHIFT)) & SAI_TCR4_FRSZ_MASK)

#define SAI_TCR4_FPACK_MASK                      (0x3000000U)
#define SAI_TCR4_FPACK_SHIFT                     (24U)
#define SAI_TCR4_FPACK_WIDTH                     (2U)
#define SAI_TCR4_FPACK(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FPACK_SHIFT)) & SAI_TCR4_FPACK_MASK)

#define SAI_TCR4_FCOMB_MASK                      (0xC000000U)
#define SAI_TCR4_FCOMB_SHIFT                     (26U)
#define SAI_TCR4_FCOMB_WIDTH                     (2U)
#define SAI_TCR4_FCOMB(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FCOMB_SHIFT)) & SAI_TCR4_FCOMB_MASK)

#define SAI_TCR4_FCONT_MASK                      (0x10000000U)
#define SAI_TCR4_FCONT_SHIFT                     (28U)
#define SAI_TCR4_FCONT_WIDTH                     (1U)
#define SAI_TCR4_FCONT(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FCONT_SHIFT)) & SAI_TCR4_FCONT_MASK)
/*! @} */

/*! @name TCR5 - Transmit Configuration 5 */
/*! @{ */

#define SAI_TCR5_FBT_MASK                        (0x1F00U)
#define SAI_TCR5_FBT_SHIFT                       (8U)
#define SAI_TCR5_FBT_WIDTH                       (5U)
#define SAI_TCR5_FBT(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR5_FBT_SHIFT)) & SAI_TCR5_FBT_MASK)

